---
kind: method
id: M:Autodesk.Revit.DB.Connector.Dispose
zh: 连接件、接口
source: html/d011d7ec-d031-c6cf-47ad-7cf486e31238.htm
---
# Autodesk.Revit.DB.Connector.Dispose Method

**中文**: 连接件、接口

Releases all resources used by the Connector

## Syntax (C#)
```csharp
public void Dispose()
```